{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "OpenVocTrajCls",
    "parent_library": "models.TrajClsModel_v2"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "value",
    "query",
    "vision_proj"
  ],
  "task_type": null
}